notes/live-coding/09-18-Introduction-to-Prolog.org
#+Title: Introduction to Prolog
#+Author: Mark Armstrong
#+Description: An introduction to Prolog and the logical programming paradigm.
#+SETUPFILE: ../../org-html-themes/setup/theme-readtheorg-local.setup

* LaTeX settings                                :noexport:

#+LaTeX_header: \usepackage{unicode-math}
#+LaTeX_header: \usepackage{unicode}

* Introduction
:PROPERTIES:
:CUSTOM_ID: Introduction
:END:

These notes were created for, and in some parts *during*,
the lecture on September 18th and the following tutorials.

* Motivation
:PROPERTIES:
:CUSTOM_ID: Motivation
:END:

Today, we begin investigating another non-imperative paradigm
other than functional programming: /logical programming/.

As we've seen in the previous hands-on lecture,
functional programming takes advantage of /immutability/ in order
to make reasoning about programs easier.
It also focuses on /compositionality/, including
in its use of /higher-order functions/, all of which
makes programming very much like writing functions in mathematics
(where there is no mutable state).

Logical programming also assumes immutability,
but instead of compositionality as a method of computation,
it uses a (Turing-complete) subset of first-order predicate logic.
Programs are databases of /inference rules/ describing the problem domain,
and programs are initiated by /queries/ about the problem domain which
the system tries to prove are true (a logical consequence of the rules)
or false (refutable by the rules).

To put it simply, in logical programming, you describe the problem,
rather than the solution.

* A note about fonts
:PROPERTIES:
:CUSTOM_ID: A-note-about-fonts
:END:

In these notes, I use plaintext blocks in order to write the
inference rules, and use em-dashes (—) to create the horizontal rules.

In some cases, the em-dashes may not show quite correctly.
For instance, in the PDF version of these notes, there is
a small space between each dash. In some browsers, they
may not show at all (they work in my install of Chrome, at least.)

Apologies for any issues reading these notes caused by this.

