notes/live-coding/09-18-Introduction-to-Prolog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-24 Thu 23:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Prolog</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="An introduction to Prolog and the logical programming paradigm."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Introduction to Prolog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Motivation">2. Motivation</a></li>
<li><a href="#A-note-about-fonts">3. A note about fonts</a></li>
<li><a href="#(Re)introduction-to-inference-rules">4. (Re)introduction to inference rules</a></li>
<li><a href="#Inference-rules-in-other-domains">5. Inference rules in other domains</a>
<ul>
<li><a href="#The-two-bucket-problem">5.1. The two bucket problem</a>
<ul>
<li><a href="#The-problem">5.1.1. The problem</a></li>
<li><a href="#The-rules">5.1.2. The rules</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#Prolog">6. Prolog</a>
<ul>
<li><a href="#Programs-are-databases-of-inference-rules">6.1. Programs are databases of inference rules</a></li>
<li><a href="#Get-“output”-by-making-queries">6.2. Get “output” by making queries</a></li>
<li><a href="#Names,-kinds-of-terms">6.3. Names, kinds of terms</a></li>
<li><a href="#Interacting-with-Prolog">6.4. Interacting with Prolog</a></li>
<li><a href="#Unification">6.5. Unification</a>
<ul>
<li><a href="#The-goal-list">6.5.1. The goal list</a></li>
<li><a href="#Backtracking">6.5.2. Backtracking</a></li>
<li><a href="#SWI-Prolog's-search-strategy">6.5.3. SWI Prolog's search strategy</a></li>
<li><a href="#Examining-the-search-strategy">6.5.4. Examining the search strategy</a></li>
</ul>
</li>
<li><a href="#Equality">6.6. Equality</a></li>
<li><a href="#Exerting-control-over-the-search;-the-cut-operator">6.7. Exerting control over the search; the cut operator</a></li>
<li><a href="#Failure">6.8. Failure</a></li>
<li><a href="#Trying-to-write-the-two-bucket-problem">6.9. Trying to write the two bucket problem</a></li>
<li><a href="#Checking-for-divisors-of-a-number">6.10. Checking for divisors of a number</a></li>
</ul>
</li>
<li><a href="#Resources">7. Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org915199f" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
These notes were created for, and in some parts <b>during</b>,
the lecture on September 18th and the following tutorials.
</p>
</div>
</div>

<div id="outline-container-orgb116e22" class="outline-2">
<h2 id="Motivation"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-Motivation">
<p>
Today, we begin investigating another non-imperative paradigm
other than functional programming: <i>logical programming</i>.
</p>

<p>
As we've seen in the previous hands-on lecture,
functional programming takes advantage of <i>immutability</i> in order
to make reasoning about programs easier.
It also focuses on <i>compositionality</i>, including
in its use of <i>higher-order functions</i>, all of which
makes programming very much like writing functions in mathematics
(where there is no mutable state).
</p>

<p>
Logical programming also assumes immutability,
but instead of compositionality as a method of computation,
it uses a (Turing-complete) subset of first-order predicate logic.
Programs are databases of <i>inference rules</i> describing the problem domain,
and programs are initiated by <i>queries</i> about the problem domain which
the system tries to prove are true (a logical consequence of the rules)
or false (refutable by the rules).
</p>

<p>
To put it simply, in logical programming, you describe the problem,
rather than the solution.
</p>
</div>
</div>

<div id="outline-container-org7a24ce1" class="outline-2">
<h2 id="A-note-about-fonts"><span class="section-number-2">3</span> A note about fonts</h2>
<div class="outline-text-2" id="text-A-note-about-fonts">
<p>
In these notes, I use plaintext blocks in order to write the
inference rules, and use em-dashes (—) to create the horizontal rules.
</p>

<p>
In some cases, the em-dashes may not show quite correctly.
For instance, in the PDF version of these notes, there is
a small space between each dash. In some browsers, they
may not show at all (they work in my install of Chrome, at least.)
</p>

<p>
Apologies for any issues reading these notes caused by this.
</p>
</div>
</div>
