notes/live-coding/09-18-Introduction-to-Prolog.tex
% Created 2020-09-23 Wed 01:39
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tabularx}
\usepackage{etoolbox}
\makeatletter
\def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}}
\AtBeginEnvironment{minted}{\dontdofcolorbox}
\makeatother
\usepackage[newfloat]{minted}
\usepackage{unicode-math}
\usepackage{unicode}
\author{Mark Armstrong}
\date{\today}
\title{Introduction to Prolog}
\hypersetup{
   pdfauthor={Mark Armstrong},
   pdftitle={Introduction to Prolog},
   pdfkeywords={},
   pdfsubject={An introduction to Prolog and the logical programming paradigm.},
   pdfcreator={Emacs 27.0.90 (Org mode 9.3.8)},
   pdflang={English},
   colorlinks,
   linkcolor=blue,
   citecolor=blue,
   urlcolor=blue
   }
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec:org39e7144}
These notes were created for, and in some parts \textbf{during},
the lecture on September 18th and the following tutorials.

\section{Motivation}
\label{sec:org0cd1665}
Today, we begin investigating another non-imperative paradigm
other than functional programming: \emph{logical programming}.

As we've seen in the previous hands-on lecture,
functional programming takes advantage of \emph{immutability} in order
to make reasoning about programs easier.
It also focuses on \emph{compositionality}, including
in its use of \emph{higher-order functions}, all of which
makes programming very much like writing functions in mathematics
(where there is no mutable state).

Logical programming also assumes immutability,
but instead of compositionality as a method of computation,
it uses a (Turing-complete) subset of first-order predicate logic.
Programs are databases of \emph{inference rules} describing the problem domain,
and programs are initiated by \emph{queries} about the problem domain which
the system tries to prove are true (a logical consequence of the rules)
or false (refutable by the rules).

To put it simply, in logical programming, you describe the problem,
rather than the solution.

\section{A note about fonts}
\label{sec:org9f777a2}
In these notes, I use plaintext blocks in order to write the
inference rules, and use em-dashes (—) to create the horizontal rules.

In some cases, the em-dashes may not show quite correctly.
For instance, in the PDF version of these notes, there is
a small space between each dash. In some browsers, they
may not show at all (they work in my install of Chrome, at least.)

Apologies for any issues reading these notes caused by this.
