notes/live-coding/09-18-Introduction-to-Prolog.html

<div id="outline-container-orgbba0f19" class="outline-2">
<h2 id="(Re)introduction-to-inference-rules"><span class="section-number-2">4</span> (Re)introduction to inference rules</h2>
<div class="outline-text-2" id="text-(Re)introduction-to-inference-rules">
<p>
Recall: an inference rule has the form
</p>
<div class="org-src-container">
<pre class="src src-text"> Premise&#8321;   Premise&#8322;   &#8230;   Premise&#8345;
&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; Rule Name
            Conclusion
</pre>
</div>
<p>
where <code>Premise₁</code>, <code>Premise₂</code>, …, and <code>Premiseₙ</code> are some statements in our
domain, and <code>Conclusion</code> is a statement
that can be concluded from the premise statements.
</p>

<p>
In the domains of logics, the statements range over formulae
(i.e., boolean expressions built up from
boolean constants, predicates and propositional connectors),
and we may have rules such as
</p>
<div class="org-src-container">
<pre class="src src-text">  P     Q
&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; &#8743;-Introduction
   P &#8743; Q
</pre>
</div>
<p>
which says “given <code>P</code> and <code>Q</code>, we may conclude <code>P ∧ Q</code>”,
</p>
<div class="org-src-container">
<pre class="src src-text">   P &#8743; Q
&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; &#8743;-Elimination&#737;
     P
</pre>
</div>
<p>
which says “given <code>P ∧ Q</code>, we may conclude <code>P</code>”, and
</p>
<div class="org-src-container">
<pre class="src src-text">  P     P &#8658; Q
&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; Modus Ponens
     Q
</pre>
</div>
<p>
which says, by translating the <code>⇒</code> to English,
“given <code>P</code> and if <code>Q</code> follows from <code>P</code>, then we can conclude <code>Q</code>”.
</p>

<p>
(Technically, these are <i>rule schemas</i>;
the <i>meta-variables</i> <code>P</code> and <code>Q</code> can be instantiated
to obtain specific rules.)
</p>

<p>
Note that in these rules, we have the following <i>meta-syntax</i>:
</p>
<ol class="org-ol">
<li>Whitespace between premises is understood as a form of conjunction.</li>
<li>The horizontal rule is understood as a form of implication.</li>
</ol>

<p>
Any rule which does not have a premise is called an <i>axiom</i>;
axioms are the known results of our domain, which do not need to be proven.
For instance,
</p>
<div class="org-src-container">
<pre class="src src-text">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; &#8868;-Introduction
  true
</pre>
</div>

<p>
A collection of inference rules (or rule schemas)
and axioms gives us a <i>proof system</i>.
</p>

<p>
See, for instance,
the <a href="https://cs.uwaterloo.ca/~david/cl/natural-deduction-pfenning.pdf">natural deduction</a> proof calculus
for classical logic.
</p>

<p>
You have likely seen the <i>equational</i> approach to proofs
which is favoured by Gries and Schneider's
“A Logical Approach to Discrete Math”, and used in
<a href="https://www.cas.mcmaster.ca/~kahl/CS2DM3/2020/">CS/SE 2dm3 at McMaster</a>
using the <a href="http://calccheck.mcmaster.ca/">CalcCheck tool</a>.
Proof systems are an alternate approach to proof;
see <a href="https://alhassy.github.io/CalcCheck/LectureNotes.html#Rules-of-Equality-and-Proof-Trees-vs-Calculational-Proofs">Musa's notes on the relationship</a> from this year's 2dm3.
</p>

<p>
Inside of a proof system, we may construct proofs of statements
via <i>proof trees</i>, which are trees where every node is a statement,
and the connections between nodes correspond to the use of rules.
</p>

<p>
For instance, we have the following silly proof of <code>true</code> which
uses the rules given above.
</p>
<div class="org-src-container">
<pre class="src src-text">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; &#8868;-Introduction        &#8212;&#8212;&#8212;&#8212;&#8212;&#8212; &#8868;-Introduction
 true                         true
&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; &#8743;-Introduction&#737;
          true &#8743; true
       &#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212; &#8743;-Elimination&#737;
             true
</pre>
</div>

<p>
Notice, by convention, we write proof trees
from the <b>bottom up</b>.
The root, at the bottom, is what we intend to prove.
The leaves, at the top, must either
</p>
<ol class="org-ol">
<li>be axioms, or</li>
<li>be local assumptions.</li>
</ol>

<p>
Proof trees may be read from the top down,
to see how the conclusion follows from the axioms and assumptions.
It is generally better to read from the bottom up, though;
otherwise the proof often seems to make
unwarranted steps, or informally, it “pulls a rabbit from its hat”.
</p>
</div>
</div>

<div id="outline-container-orgf5d71bf" class="outline-2">
<h2 id="Inference-rules-in-other-domains"><span class="section-number-2">5</span> Inference rules in other domains</h2>
<div class="outline-text-2" id="text-Inference-rules-in-other-domains">
<p>
The use of inference rules is not limited to the domain of logics.
</p>

<p>
It is perhaps better not to think of inference rules
as defining a <i>proof system</i> (which makes us think
of truth values and logics),
but as defining a <i>game</i>: starting from
the rules and axioms, what can we obtain?
</p>

<p>
For instance, consider the following problem.
</p>
</div>
