notes/live-coding/09-18-Introduction-to-Prolog.org
*** The problem
:PROPERTIES:
:CUSTOM_ID: The-problem
:END:

Suppose you are given two buckets,
- one of which holds 5 units of water, and
- one of which holds 3 units of water.

You are tasked with collecting exactly 4 units of water;
no more, and no less.
You begin with 0 units in both buckets.

You may at any point
- fill one bucket entirely from a tap,
- pour the water out of a bucket, emptying it entirely, or
- pour one bucket into another until either the first is empty
  or the second is full.

You are tasked with collecting exactly 4 units of water
using only those three kinds of actions.

*** The rules
:PROPERTIES:
:CUSTOM_ID: The-rules
:END:

Let us represent the state of the bucket by a pair of numbers.
In these rules, we will use
- ~x~ as a meta-variable for the amount
  in the bucket which can hold 5 units, and
- ~y~ as a meta-variable for the amount
  in the bucket which can hold 3 units.

We can begin only if we have 0 units in both buckets.
#+begin_src text

          ––––––––— Start
            0 , 0
#+end_src

The action of filling a bucket replaces its current amount
with the maximum amount.
#+begin_src text
  X , Y                  X , Y
––––––––— Fillˡ        ––––––––– Fillʳ
  5 , Y                  X , 3
#+end_src

The action of emptying a bucket replaces its current amount
with 0.
#+begin_src text
  X , Y                  X , Y
––––––––— Emptyˡ       ––––––––– Emptyʳ
  0 , Y                  X , 0  
#+end_src

:TODO:
#+begin_src text
     X , Y        
–—–––––––————–– Pourˡ (provided X + D ≤ 5 ∧ Y - D ≥ 0 ∧ (X + D = 5 ∨ Y - D = 0))
 X + D , Y - D

     X , Y        
––––––––––––––— Pourʳ (provided X - D ≥ 5 ∧ Y + D ≤ 0 ∧ (X - D = 0 ∨ Y + D = 3))
 X - D , Y + D
#+end_src

* Prolog
:PROPERTIES:
:CUSTOM_ID: Prolog
:END:

** Programs are databases of inference rules
:PROPERTIES:
:CUSTOM_ID: Programs-are-databases-of-inference-rules
:END:

Prolog programs are simply databases of inference rules,
also called /clauses/.
An inference rule
#+begin_src text
 A₁   A₂   …   Aₙ
––––––––––––––––––––
      B
#+end_src
is written in Prolog as the clause
#+begin_src prolog
b :- a1, a2, …, an.
#+end_src
(the … is pseudocode, not Prolog syntax)
(notice the period ending the rule).
As with our inference rule, this rule states that
~b~ is true if all of the ~aᵢ~ are true.
So we can think of ~:-~ as ~⇐~, and ~,~ as ~∧~.

An axiom
#+begin_src text
––––––––––––––
      C
#+end_src
can be written in Prolog as
#+begin_src prolog
c :- true.
#+end_src
or, more simply,
#+begin_src prolog
c.
#+end_src

** Get “output” by making queries
:PROPERTIES:
:CUSTOM_ID: Get-“output”-by-making-queries
:END:

To interact with Prolog programs, we make /queries/, to which Prolog
responds by checking its inference rule database to determine
possible answers.

For instance, list catenation in SWI Prolog is a ternary predicate
#+begin_example prolog
concat(X,Y,Z)
#+end_example
the rules of which enforce that ~Z~ is the result
of catenating ~X~ and ~Y~.

So we can make queries about catenation, such as
#+begin_example prolog
% Is [1,2,3,4,5,6] the result of catenating [1,2,3] and [4,5,6]?
?- append([1,2,3], [4,5,6], [1,2,3,4,5,6])
% Response:
% true.


% What are all the possible values of Z for which
% Z is the catenation of [1,2,3] and [4,5,6]?
?- append([1,2,3], [4,5,6], Z)
% Response:
% Z = [1, 2, 3, 4, 5, 6]


% What are the possible values of X and Y so that,
% when they are catenated, the result is [1,2,3,4,5,6]?
?- append(X, Y, [1,2,3,4,5,6])
% Response:
% X = [],
% Y = [1,2,3,4,5,6] ;
% X = [1],
% Y = [2,3,4,5,6] ;
% …
#+end_example

Note: in this way, we get several “functions” from one predicate,
depending upon what question(s) we ask!

