notes/live-coding/09-18-Introduction-to-Prolog.html

<div id="outline-container-orga331dfc" class="outline-3">
<h3 id="The-two-bucket-problem"><span class="section-number-3">5.1</span> The two bucket problem</h3>
<div class="outline-text-3" id="text-The-two-bucket-problem">
</div>

<div id="outline-container-org604c20c" class="outline-4">
<h4 id="The-problem"><span class="section-number-4">5.1.1</span> The problem</h4>
<div class="outline-text-4" id="text-The-problem">
<p>
Suppose you are given two buckets,
</p>
<ul class="org-ul">
<li>one of which holds 5 units of water, and</li>
<li>one of which holds 3 units of water.</li>
</ul>

<p>
You are tasked with collecting exactly 4 units of water;
no more, and no less.
You begin with 0 units in both buckets.
</p>

<p>
You may at any point
</p>
<ul class="org-ul">
<li>fill one bucket entirely from a tap,</li>
<li>pour the water out of a bucket, emptying it entirely, or</li>
<li>pour one bucket into another until either the first is empty
or the second is full.</li>
</ul>

<p>
You are tasked with collecting exactly 4 units of water
using only those three kinds of actions.
</p>
</div>
</div>

<div id="outline-container-org041fd94" class="outline-4">
<h4 id="The-rules"><span class="section-number-4">5.1.2</span> The rules</h4>
<div class="outline-text-4" id="text-The-rules">
<p>
Let us represent the state of the bucket by a pair of numbers.
In these rules, we will use
</p>
<ul class="org-ul">
<li><code>x</code> as a meta-variable for the amount
in the bucket which can hold 5 units, and</li>
<li><code>y</code> as a meta-variable for the amount
in the bucket which can hold 3 units.</li>
</ul>

<p>
We can begin only if we have 0 units in both buckets.
</p>
<div class="org-src-container">
<pre class="src src-text">
          &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Start
            0 , 0
</pre>
</div>

<p>
The action of filling a bucket replaces its current amount
with the maximum amount.
</p>
<div class="org-src-container">
<pre class="src src-text">  X , Y                  X , Y
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Fill&#737;        &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; Fill&#691;
  5 , Y                  X , 3
</pre>
</div>

<p>
The action of emptying a bucket replaces its current amount
with 0.
</p>
<div class="org-src-container">
<pre class="src src-text">  X , Y                  X , Y
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Empty&#737;       &#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211; Empty&#691;
  0 , Y                  X , 0  
</pre>
</div>

<p>
:TODO:
</p>
<div class="org-src-container">
<pre class="src src-text">     X , Y        
&#8211;&#8212;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212;&#8212;&#8212;&#8212;&#8211;&#8211; Pour&#737; <span style="color: #00cd68;">(</span>provided X + D &#8804; 5 &#8743; Y - D &#8805; 0 &#8743; <span style="color: #b6a0ff;">(</span>X + D = 5 &#8744; Y - D = 0<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
 X + D , Y - D

     X , Y        
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8212; Pour&#691; <span style="color: #00cd68;">(</span>provided X - D &#8805; 5 &#8743; Y + D &#8804; 0 &#8743; <span style="color: #b6a0ff;">(</span>X - D = 0 &#8744; Y + D = 3<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
 X - D , Y + D
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf1297a6" class="outline-2">
<h2 id="Prolog"><span class="section-number-2">6</span> Prolog</h2>
<div class="outline-text-2" id="text-Prolog">
</div>

<div id="outline-container-org0f50a9a" class="outline-3">
<h3 id="Programs-are-databases-of-inference-rules"><span class="section-number-3">6.1</span> Programs are databases of inference rules</h3>
<div class="outline-text-3" id="text-Programs-are-databases-of-inference-rules">
<p>
Prolog programs are simply databases of inference rules,
also called <i>clauses</i>.
An inference rule
</p>
<div class="org-src-container">
<pre class="src src-text"> A&#8321;   A&#8322;   &#8230;   A&#8345;
&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;
      B
</pre>
</div>
<p>
is written in Prolog as the clause
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #feacd0;">b</span> :- a1, a2, &#8230;, an.
</pre>
</div>
<p>
(the … is pseudocode, not Prolog syntax)
(notice the period ending the rule).
As with our inference rule, this rule states that
<code>b</code> is true if all of the <code>aᵢ</code> are true.
So we can think of <code>:-</code> as <code>⇐</code>, and <code>,</code> as <code>∧</code>.
</p>

<p>
An axiom
</p>
<div class="org-src-container">
<pre class="src src-text">&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;&#8211;
      C
</pre>
</div>
<p>
can be written in Prolog as
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #feacd0;">c</span> :- true.
</pre>
</div>
<p>
or, more simply,
</p>
<div class="org-src-container">
<pre class="src src-prolog">c.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1ecc25" class="outline-3">
<h3 id="Get-“output”-by-making-queries"><span class="section-number-3">6.2</span> Get “output” by making queries</h3>
<div class="outline-text-3" id="text-Get-“output”-by-making-queries">
<p>
To interact with Prolog programs, we make <i>queries</i>, to which Prolog
responds by checking its inference rule database to determine
possible answers.
</p>

<p>
For instance, list catenation in SWI Prolog is a ternary predicate
</p>
<pre class="example">
append(X,Y,Z)
</pre>
<p>
the rules of which enforce that <code>Z</code> is the result
of catenating <code>X</code> and <code>Y</code>.
</p>

<p>
So we can make queries about catenation, such as
</p>
<pre class="example">
% Is [1,2,3,4,5,6] the result of catenating [1,2,3] and [4,5,6]?
?- append([1,2,3], [4,5,6], [1,2,3,4,5,6])
% Response:
% true.


% What are all the possible values of Z for which
% Z is the catenation of [1,2,3] and [4,5,6]?
?- append([1,2,3], [4,5,6], Z)
% Response:
% Z = [1, 2, 3, 4, 5, 6]


% What are the possible values of X and Y so that,
% when they are catenated, the result is [1,2,3,4,5,6]?
?- append(X, Y, [1,2,3,4,5,6])
% Response:
% X = [],
% Y = [1,2,3,4,5,6] ;
% X = [1],
% Y = [2,3,4,5,6] ;
% …
</pre>

<p>
Note: in this way, we get several “functions” from one predicate,
depending upon what question(s) we ask!
</p>
</div>
</div>
