notes/live-coding/09-18-Introduction-to-Prolog.tex

\subsection{The two bucket problem}
\label{sec:org2e4c8d8}
\subsubsection{The problem}
\label{sec:org49f6d66}
Suppose you are given two buckets,
\begin{itemize}
\item one of which holds 5 units of water, and
\item one of which holds 3 units of water.
\end{itemize}

You are tasked with collecting exactly 4 units of water;
no more, and no less.
You begin with 0 units in both buckets.

You may at any point
\begin{itemize}
\item fill one bucket entirely from a tap,
\item pour the water out of a bucket, emptying it entirely, or
\item pour one bucket into another until either the first is empty
or the second is full.
\end{itemize}

You are tasked with collecting exactly 4 units of water
using only those three kinds of actions.

\subsubsection{The rules}
\label{sec:org86deef5}
Let us represent the state of the bucket by a pair of numbers.
In these rules, we will use
\begin{itemize}
\item \texttt{x} as a meta-variable for the amount
in the bucket which can hold 5 units, and
\item \texttt{y} as a meta-variable for the amount
in the bucket which can hold 3 units.
\end{itemize}

We can begin only if we have 0 units in both buckets.
\begin{minted}[breaklines=true]{text}

          ––––––––— Start
            0 , 0
\end{minted}

The action of filling a bucket replaces its current amount
with the maximum amount.
\begin{minted}[breaklines=true]{text}
  X , Y                  X , Y
––––––––— Fillˡ        ––––––––– Fillʳ
  5 , Y                  X , 3
\end{minted}

The action of emptying a bucket replaces its current amount
with 0.
\begin{minted}[breaklines=true]{text}
  X , Y                  X , Y
––––––––— Emptyˡ       ––––––––– Emptyʳ
  0 , Y                  X , 0  
\end{minted}

:TODO:
\begin{minted}[breaklines=true]{text}
     X , Y        
–—–––––––————–– Pourˡ (provided X + D ≤ 5 ∧ Y - D ≥ 0 ∧ (X + D = 5 ∨ Y - D = 0))
 X + D , Y - D

     X , Y        
––––––––––––––— Pourʳ (provided X - D ≥ 5 ∧ Y + D ≤ 0 ∧ (X - D = 0 ∨ Y + D = 3))
 X - D , Y + D
\end{minted}

\section{Prolog}
\label{sec:orgcad28d4}
\subsection{Programs are databases of inference rules}
\label{sec:orgc1cad92}
Prolog programs are simply databases of inference rules,
also called \emph{clauses}.
An inference rule
\begin{minted}[breaklines=true]{text}
 A₁   A₂   …   Aₙ
––––––––––––––––––––
      B
\end{minted}
is written in Prolog as the clause
\begin{minted}[breaklines=true]{prolog}
b :- a1, a2, …, an.
\end{minted}
(the … is pseudocode, not Prolog syntax)
(notice the period ending the rule).
As with our inference rule, this rule states that
\texttt{b} is true if all of the \texttt{aᵢ} are true.
So we can think of \texttt{:-} as \texttt{⇐}, and \texttt{,} as \texttt{∧}.

An axiom
\begin{minted}[breaklines=true]{text}
––––––––––––––
      C
\end{minted}
can be written in Prolog as
\begin{minted}[breaklines=true]{prolog}
c :- true.
\end{minted}
or, more simply,
\begin{minted}[breaklines=true]{prolog}
c.
\end{minted}

\subsection{Get “output” by making queries}
\label{sec:orgafaf846}
To interact with Prolog programs, we make \emph{queries}, to which Prolog
responds by checking its inference rule database to determine
possible answers.

For instance, list catenation in SWI Prolog is a ternary predicate
\begin{verbatim}
append(X,Y,Z)
\end{verbatim}
the rules of which enforce that \texttt{Z} is the result
of catenating \texttt{X} and \texttt{Y}.

So we can make queries about catenation, such as
\begin{verbatim}
% Is [1,2,3,4,5,6] the result of catenating [1,2,3] and [4,5,6]?
?- append([1,2,3], [4,5,6], [1,2,3,4,5,6])
% Response:
% true.


% What are all the possible values of Z for which
% Z is the catenation of [1,2,3] and [4,5,6]?
?- append([1,2,3], [4,5,6], Z)
% Response:
% Z = [1, 2, 3, 4, 5, 6]


% What are the possible values of X and Y so that,
% when they are catenated, the result is [1,2,3,4,5,6]?
?- append(X, Y, [1,2,3,4,5,6])
% Response:
% X = [],
% Y = [1,2,3,4,5,6] ;
% X = [1],
% Y = [2,3,4,5,6] ;
% …
\end{verbatim}

Note: in this way, we get several “functions” from one predicate,
depending upon what question(s) we ask!
