notes/live-coding/09-18-Introduction-to-Prolog.org
** Names, kinds of terms
:PROPERTIES:
:CUSTOM_ID: Names,-kinds-of-terms
:END:

In Prolog, any name beginning with an upper case letter
denotes a variable.

Names which begin with lower case letters are /atoms/,
which are a type of constant value.
Atoms may be used as the name of predicates.

Character strings surrounded by single quotes, ~'~,
are also atoms. So we can write
#+begin_example prolog
'is an empty list'([]).
#+end_example

As you would expect, Prolog also has numerical constants,
such as ~1~ or ~3.14~.

Aside from variables and constants,
the remaining kind of Prolog term is a /structure/,
which has the form
#+begin_example prolog
atom(term1, …, term1)
#+end_example
(again, the … is pseudocode.)

** Interacting with Prolog
:PROPERTIES:
:CUSTOM_ID: Interacting-with-Prolog
:END:

As we've said, a Prolog program consists of clauses
(inference rules.)
For instance
#+begin_example prolog
head(X) :- body(X,Y)
#+end_example
which can be interpreted as having meaning
#+begin_src text
∀ X ‌∙ head(X) ⇐ (∃ Y • body(X,Y))
#+end_src
Then during computation, given this clause and the goal ~head(X)~,
the Prolog runtime is tasked with finding a substitution for ~Y~
which makes ~body(X,Y)~ true.

We provide Prolog with goals through queries,
usually by loading our programs into the interactive query REPL,
either by running
#+begin_src shell
$ swipl my-program.pl
#+end_src
from the command line, or
#+begin_example prolog
?- consult('my-program.pl')
#+end_example
once running SWI Prolog.
We can also ~assert~ or ~retract~ rules in the query REPL, if needed.
(Also, use ~listing~ or ~listing(name)~ to see all given clauses
or clauses about the ~name~ predicate.)

** Unification

The computation model of Prolog involves /unification/ of terms.
Terms unify if either
1. they are equal, or
2. they contain variables that can be instantiated in a way
   that makes the terms equal.

So in general, unification involves /searching/ for possible
variable bindings, by making use of the clauses
and /modus ponens/ ($(P ∧ P ⇒ Q) ⇒ Q$).

*** The goal list

Through this process, the single goal presented by a query
will usually turn into a collection of goals;
for instance, if we query ~?- p(5).~ and the search uses a clause
#+begin_example prolog
p(X) :- q(X), r(X).
#+end_example
then we now have as goals ~q(5)~ and ~r(5)~.

*** Backtracking
:PROPERTIES:
:CUSTOM_ID: Backtracking
:END:

Consider the program
#+begin_src prolog :tangle ./src/sept20-backtracking.pl
a :- b, c.
a :- b.

b.
c :- false.
#+end_src

As the Prolog runtime tries to prove ~a~, it will use the first clause,
and ~fail~ (because in trying to prove ~c~, it reaches ~false~,
which it cannot prove.)
At that point, it has to /backtrack/, and try a different
clause to prove ~a~.

In general, the runtime will backtrack several times
during a proof, and it keeps track of which clauses
have been tried.

# Untried rules

*** SWI Prolog's search strategy
:PROPERTIES:
:CUSTOM_ID: SWI-Prolog's-search-strategy
:END:

1. Attempt to apply clauses in order from top to bottom
   (as in the source code.)
   - Only backtrack and try other clauses
     after success or failure.
2. Perform a depth first search trying to prove each goal.
   - So if the current goals are ~b~ and ~c~,
     try to prove ~b~ before considering ~c~.

*** Examining the search strategy
:PROPERTIES:
:CUSTOM_ID: Examining-the-search-strategy
:END:

In order to interactively see the process Prolog is using
during unification,
use the ~trace.~ command in the REPL.
Then each query will result in a log of calls made and
failures encountered.

** Equality
:PROPERTIES:
:CUSTOM_ID: Equality
:END:

Prolog does have an equality comparison , written simply ~=~ (not ~==~).
*However*, this equality does no simplification.
So, for instance, if a variable ~X~ has been unified to value ~5~,
#+begin_example prolog
X = 5
#+end_example
would be ~true~, but
#+begin_example prolog
X = 2 + 3
#+end_example
would be ~false~.

This non-simplifying equality allows us to consider
the /construction/ of terms, rather than just their value.
But in case we want to actually carry out arithmetic
or calculate other values,
we can use the ~is~ comparison.
#+begin_example prolog
X is 2 + 3
#+end_example
will evaluate to ~true~.

