notes/live-coding/09-18-Introduction-to-Prolog.html

<div id="outline-container-orgc191702" class="outline-3">
<h3 id="Names,-kinds-of-terms"><span class="section-number-3">6.3</span> Names, kinds of terms</h3>
<div class="outline-text-3" id="text-Names,-kinds-of-terms">
<p>
In Prolog, any name beginning with an upper case letter
denotes a variable.
</p>

<p>
Names which begin with lower case letters are <i>atoms</i>,
which are a type of constant value.
Atoms may be used as the name of predicates.
</p>

<p>
Character strings surrounded by single quotes, <code>'</code>,
are also atoms. So we can write
</p>
<pre class="example">
'is an empty list'([]).
</pre>

<p>
As you would expect, Prolog also has numerical constants,
such as <code>1</code> or <code>3.14</code>.
</p>

<p>
Aside from variables and constants,
the remaining kind of Prolog term is a <i>structure</i>,
which has the form
</p>
<pre class="example">
atom(term1, …, term1)
</pre>
<p>
(again, the … is pseudocode.)
</p>
</div>
</div>

<div id="outline-container-org110236a" class="outline-3">
<h3 id="Interacting-with-Prolog"><span class="section-number-3">6.4</span> Interacting with Prolog</h3>
<div class="outline-text-3" id="text-Interacting-with-Prolog">
<p>
As we've said, a Prolog program consists of clauses
(inference rules.)
For instance
</p>
<pre class="example">
head(X) :- body(X,Y)
</pre>
<p>
which can be interpreted as having meaning
</p>
<div class="org-src-container">
<pre class="src src-text">&#8704; X &#8204;&#8729; head<span style="color: #00cd68;">(</span>X<span style="color: #00cd68;">)</span> &#8656; <span style="color: #00cd68;">(</span>&#8707; Y &#8226; body<span style="color: #b6a0ff;">(</span>X,Y<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
<p>
Then during computation, given this clause and the goal <code>head(X)</code>,
the Prolog runtime is tasked with finding a substitution for <code>Y</code>
which makes <code>body(X,Y)</code> true.
</p>

<p>
We provide Prolog with goals through queries,
usually by loading our programs into the interactive query REPL,
either by running
</p>
<div class="org-src-container">
<pre class="src src-shell">$ swipl my-program.pl
</pre>
</div>
<p>
from the command line, or
</p>
<pre class="example">
?- consult('my-program.pl')
</pre>
<p>
once running SWI Prolog.
We can also <code>assert</code> or <code>retract</code> rules in the query REPL, if needed.
(Also, use <code>listing</code> or <code>listing(name)</code> to see all given clauses
or clauses about the <code>name</code> predicate.)
</p>
</div>
</div>

<div id="outline-container-org6bb5ba0" class="outline-3">
<h3 id="Unification"><span class="section-number-3">6.5</span> Unification</h3>
<div class="outline-text-3" id="text-Unification">
<p>
The computation model of Prolog involves <i>unification</i> of terms.
Terms unify if either
</p>
<ol class="org-ol">
<li>they are equal, or</li>
<li>they contain variables that can be instantiated in a way
that makes the terms equal.</li>
</ol>

<p>
So in general, unification involves <i>searching</i> for possible
variable bindings, by making use of the clauses
and <i>modus ponens</i> (\((P ∧ P ⇒ Q) ⇒ Q\)).
</p>
</div>

<div id="outline-container-orgc4178ac" class="outline-4">
<h4 id="The-goal-list"><span class="section-number-4">6.5.1</span> The goal list</h4>
<div class="outline-text-4" id="text-The-goal-list">
<p>
Through this process, the single goal presented by a query
will usually turn into a collection of goals;
for instance, if we query <code>?- p(5).</code> and the search uses a clause
</p>
<pre class="example">
p(X) :- q(X), r(X).
</pre>
<p>
then we now have as goals <code>q(5)</code> and <code>r(5)</code>.
</p>
</div>
</div>

<div id="outline-container-org93695d7" class="outline-4">
<h4 id="Backtracking"><span class="section-number-4">6.5.2</span> Backtracking</h4>
<div class="outline-text-4" id="text-Backtracking">
<p>
Consider the program
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #feacd0;">a</span> :- b, c.
<span style="color: #feacd0;">a</span> :- b.

b.
<span style="color: #feacd0;">c</span> :- false.
</pre>
</div>

<p>
As the Prolog runtime tries to prove <code>a</code>, it will use the first clause,
and <code>fail</code> (because in trying to prove <code>c</code>, it reaches <code>false</code>,
which it cannot prove.)
At that point, it has to <i>backtrack</i>, and try a different
clause to prove <code>a</code>.
</p>

<p>
In general, the runtime will backtrack several times
during a proof, and it keeps track of which clauses
have been tried.
</p>

<p>
:TODO: Aside: contradictory clauses
</p>
<pre class="example">
a :- false.
a.
</pre>
</div>
</div>

<div id="outline-container-org1d3e8a6" class="outline-4">
<h4 id="SWI-Prolog's-search-strategy"><span class="section-number-4">6.5.3</span> SWI Prolog's search strategy</h4>
<div class="outline-text-4" id="text-SWI-Prolog's-search-strategy">
<ol class="org-ol">
<li>Attempt to apply clauses in order from top to bottom
(as in the source code.)
<ul class="org-ul">
<li>Only backtrack and try other clauses
after success or failure.</li>
</ul></li>
<li>Perform a depth first search trying to prove each goal.
<ul class="org-ul">
<li>So if the current goals are <code>b</code> and <code>c</code>,
try to prove <code>b</code> before considering <code>c</code>.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org8e534f1" class="outline-4">
<h4 id="Examining-the-search-strategy"><span class="section-number-4">6.5.4</span> Examining the search strategy</h4>
<div class="outline-text-4" id="text-Examining-the-search-strategy">
<p>
In order to interactively see the process Prolog is using
during unification,
use the <code>trace.</code> command in the REPL.
Then each query will result in a log of calls made and
failures encountered.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd82100c" class="outline-3">
<h3 id="Equality"><span class="section-number-3">6.6</span> Equality</h3>
<div class="outline-text-3" id="text-Equality">
<p>
Prolog does have an equality comparison , written simply <code>=</code> (not <code>==</code>).
<b>However</b>, this equality does no simplification.
So, for instance, if a variable <code>X</code> has been unified to value <code>5</code>,
</p>
<pre class="example">
X = 5
</pre>
<p>
would be <code>true</code>, but
</p>
<pre class="example">
X = 2 + 3
</pre>
<p>
would be <code>false</code>.
</p>

<p>
This non-simplifying equality allows us to consider
the <i>construction</i> of terms, rather than just their value.
But in case we want to actually carry out arithmetic
or calculate other values,
we can use the <code>is</code> comparison.
</p>
<pre class="example">
X is 2 + 3
</pre>
<p>
will evaluate to <code>true</code>.
</p>
</div>
</div>
