notes/live-coding/09-18-Introduction-to-Prolog.tex

\subsection{Names, kinds of terms}
\label{sec:org7b251a2}
In Prolog, any name beginning with an upper case letter
denotes a variable.

Names which begin with lower case letters are \emph{atoms},
which are a type of constant value.
Atoms may be used as the name of predicates.

Character strings surrounded by single quotes, \texttt{'},
are also atoms. So we can write
\begin{verbatim}
'is an empty list'([]).
\end{verbatim}

As you would expect, Prolog also has numerical constants,
such as \texttt{1} or \texttt{3.14}.

Aside from variables and constants,
the remaining kind of Prolog term is a \emph{structure},
which has the form
\begin{verbatim}
atom(term1, …, term1)
\end{verbatim}
(again, the … is pseudocode.)

\subsection{Interacting with Prolog}
\label{sec:orgdf12f0c}
As we've said, a Prolog program consists of clauses
(inference rules.)
For instance
\begin{verbatim}
head(X) :- body(X,Y)
\end{verbatim}
which can be interpreted as having meaning
\begin{minted}[breaklines=true]{text}
∀ X ‌∙ head(X) ⇐ (∃ Y • body(X,Y))
\end{minted}
Then during computation, given this clause and the goal \texttt{head(X)},
the Prolog runtime is tasked with finding a substitution for \texttt{Y}
which makes \texttt{body(X,Y)} true.

We provide Prolog with goals through queries,
usually by loading our programs into the interactive query REPL,
either by running
\begin{minted}[breaklines=true]{shell}
$ swipl my-program.pl
\end{minted}
from the command line, or
\begin{verbatim}
?- consult('my-program.pl')
\end{verbatim}
once running SWI Prolog.
We can also \texttt{assert} or \texttt{retract} rules in the query REPL, if needed.
(Also, use \texttt{listing} or \texttt{listing(name)} to see all given clauses
or clauses about the \texttt{name} predicate.)

\subsection{Unification}
\label{sec:orgd5db950}
The computation model of Prolog involves \emph{unification} of terms.
Terms unify if either
\begin{enumerate}
\item they are equal, or
\item they contain variables that can be instantiated in a way
that makes the terms equal.
\end{enumerate}

So in general, unification involves \emph{searching} for possible
variable bindings, by making use of the clauses
and \emph{modus ponens} (\((P ∧ P ⇒ Q) ⇒ Q\)).

\subsubsection{The goal list}
\label{sec:org7ab4224}
Through this process, the single goal presented by a query
will usually turn into a collection of goals;
for instance, if we query \texttt{?- p(5).} and the search uses a clause
\begin{verbatim}
p(X) :- q(X), r(X).
\end{verbatim}
then we now have as goals \texttt{q(5)} and \texttt{r(5)}.

\subsubsection{Backtracking}
\label{sec:org7203683}
Consider the program
\begin{minted}[breaklines=true]{prolog}
a :- b, c.
a :- b.

b.
c :- false.
\end{minted}

As the Prolog runtime tries to prove \texttt{a}, it will use the first clause,
and \texttt{fail} (because in trying to prove \texttt{c}, it reaches \texttt{false},
which it cannot prove.)
At that point, it has to \emph{backtrack}, and try a different
clause to prove \texttt{a}.

In general, the runtime will backtrack several times
during a proof, and it keeps track of which clauses
have been tried.

:TODO: Aside: contradictory clauses
\begin{verbatim}
a :- false.
a.
\end{verbatim}

\subsubsection{SWI Prolog's search strategy}
\label{sec:org3926926}
\begin{enumerate}
\item Attempt to apply clauses in order from top to bottom
(as in the source code.)
\begin{itemize}
\item Only backtrack and try other clauses
after success or failure.
\end{itemize}
\item Perform a depth first search trying to prove each goal.
\begin{itemize}
\item So if the current goals are \texttt{b} and \texttt{c},
try to prove \texttt{b} before considering \texttt{c}.
\end{itemize}
\end{enumerate}

\subsubsection{Examining the search strategy}
\label{sec:org5fa59c9}
In order to interactively see the process Prolog is using
during unification,
use the \texttt{trace.} command in the REPL.
Then each query will result in a log of calls made and
failures encountered.

\subsection{Equality}
\label{sec:orga92b26f}
Prolog does have an equality comparison , written simply \texttt{=} (not \texttt{==}).
\textbf{However}, this equality does no simplification.
So, for instance, if a variable \texttt{X} has been unified to value \texttt{5},
\begin{verbatim}
X = 5
\end{verbatim}
would be \texttt{true}, but
\begin{verbatim}
X = 2 + 3
\end{verbatim}
would be \texttt{false}.

This non-simplifying equality allows us to consider
the \emph{construction} of terms, rather than just their value.
But in case we want to actually carry out arithmetic
or calculate other values,
we can use the \texttt{is} comparison.
\begin{verbatim}
X is 2 + 3
\end{verbatim}
will evaluate to \texttt{true}.
